
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8672188390)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * google_cloud_run_service_iam_policy.noauth
* Update
  * google_storage_bucket.public_image_bucket
* Replace
  * google_cloud_run_service.cloudrun-dev-main-backend


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_service.cloudrun-dev-main-backend is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "cloudrun-dev-main-backend" {
      ~ id                         = "locations/asia-northeast1/namespaces/lgtmgen-project/services/dev-main-backend" -> (known after apply)
        name                       = "dev-main-backend"
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = <<-EOT
                            Revision 'dev-main-backend-00001-8sg' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=lgtmgen-project&resource=cloud_run_revision/service_name/dev-main-backend/revision_name/dev-main-backend-00001-8sg&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22dev-main-backend%22%0Aresource.labels.revision_name%3D%22dev-main-backend-00001-8sg%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - message = <<-EOT
                            Revision 'dev-main-backend-00001-8sg' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=lgtmgen-project&resource=cloud_run_revision/service_name/dev-main-backend/revision_name/dev-main-backend-00001-8sg&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22dev-main-backend%22%0Aresource.labels.revision_name%3D%22dev-main-backend-00001-8sg%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "dev-main-backend-00001-8sg"
              - latest_ready_revision_name   = "dev-main-backend-00001-8sg"
              - observed_generation          = 1
              - traffic                      = []
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "fcee27c2-5416-4c20-8ae6-b4ea1e1acd64"
              - "serving.knative.dev/creator"       = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "lgtmgen-project" -> null
          - resource_version      = "AAYV9eNrGxI" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/228944830644/services/dev-main-backend" -> null
          - terraform_labels      = {} -> null
          - uid                   = "9dda0fef-cbba-43de-a9e6-78bf5791d200" -> null
        }

      ~ template {
          - metadata {
              - annotations      = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation       = 0 -> null
              - labels           = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> null
                name             = null
                # (4 unchanged attributes hidden)
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              ~ service_account_name  = "228944830644-compute@developer.gserviceaccount.com" -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)

              ~ containers {
                  - args        = [] -> null
                  - command     = [] -> null
                  ~ image       = "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/backend" -> "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/backend:latest"
                  + name        = (known after apply)
                    # (1 unchanged attribute hidden)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                        # (1 unchanged attribute hidden)
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "lgtmgen-project"
      + service     = "dev-main-backend"
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":11,"Program":"tfcmt","SHA1":"d06bd1786cbe7709800dc87644c74ac3afe202ee","Target":"dev","Vars":{},"WorkflowName":"Run terragrunt plan on PR submission"} -->